ParameterCFIcase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;

Dab             Dab        [0 2 -1 0 0 0 0]    1e-9;
Dabbound        Dabbound   [0 2 -1 0 0 0 0]    1e-9;


nu              nu    [0 2 -1 0 0 0 0] 1.0e-6;
nua             nua   [0 2 -1 0 0 0 0] 1.0e-6;
rho1            rho1  [1 -3 0 0 0 0 0] 1000;
rho2            rho2  [1 -3 0 0 0 0 0] 1000;

lambdadan       lambdadan   [-1 1 3 0 0 0 0] 1;

alphasolidini   alphasolidini [1 -3 -1 0 0 0 0] 1e6;
alphasolidmax   alphasolidmax [1 -3 -1 0 0 0 0] 1e6;
alphaMaxdelta   alphaMaxdelta [1 -3 -1 0 0 0 0] 10;
alphaMax        alphaMax      [1 -3 -1 0 0 0 0] 1e9;
alphasolidmin   alphasolidmin [1 -3 -1 0 0 0 0] 0;

Rmin            Rmin [0  1  0 0 0 0 0] 1.4435e-06;

asqaini         0.001;
asqa            0.001;
asqadelta       0.001;
asqamax         0.1;

raa0                   1e-5;
mma_init               0.2;
mma_dec                0.7;
mma_inc                1.2;
movlim                 0.5;

voluse                 0.6;
filter_Radius          1;
solid_area             0;
fluid_area             1;
test_PD                0;

D_normalization        1.81558e-06;
D0                     16;
D1                     10;
J0                     0.8;
J1                     0.05;

geo_dim                2;


// ************************************************************************* //
