ParameterCFIcase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (5e-3 0 0);

boundaryField
{
    INLET1
    {
        type parabolicVelocityDown;
        n (1 0 0);
        y (0 1 0);
        maxValue 5e-3;
    }
    INLET2
    {
        type parabolicVelocityUp;
        n (1 0 0);
        y (0 1 0);
        maxValue 5e-3;
    }
    OUTLET
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }	
    ALLWALL
    {
        type            noSlip;
    }
}


// ************************************************************************* //
