ParameterCFIcase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET1
    {
        type            fixedFluxPressure;
    }
    INLET2
    {
        type            fixedFluxPressure;
    }
    OUTLET
    {
        type            totalPressure;
        p0              uniform 0;
    }	
    ALLWALL
    {
        type            fixedFluxPressure;
    }
}


// ************************************************************************* //
